/**
 *  Class: Constants
 *  Author: Li yafei
 *  Date: 16/9/2.
 *  Description: 常量
 */


const Constants = {
  /**
   * 数组对象缓存
   * 使用时需要设置key
   **/
  resultsCache: {},



  // 1营业收入  //  净利润统计 //资产负债
  businessIncome: {
    title: '营业收入',
    itemTitle:['目标值','完成值','目标达成率'],
    xAxisData:['1','2','3','4','5','6','7','8','9','10','11','12'],
    // yAxisData:['0','15000','30000','45000','60000'],
    yAxisData1:['0','25','50','75','100'],
    seriesLineData:[55850,55850,55850,55850,55850,55850,55850,55850,55850,55850,55850,55850], //营业收入-目标值
    seriesBarData1:[3305, 7123, 11234, 15882, 20386,25027, 29795, 34451, 39621, 44908], //营业收入-完成值
    seriesLineData2:[6,13, 20, 28, 37, 45, 53, 62, 71, 80], //营业收入-目标达成率
  },
  //  2净利润

  netProfit:{
    title: '净利润',
    itemTitle:['目标值','完成值','目标达成率'],
    xAxisData:['1','2','3','4','5','6','7','8','9','10','11','12'],
    // yAxisData:['0','15000','30000','45000','1334'],
    yAxisData1:['0','25','50','75','100'],
    seriesLineData:[1334,1334,1334,1334,1334,1334,1334,1334,1334,1334,1334,1334], //净利润-目标值
    seriesBarData1:[115, 219, 300, 438, 642,733, 850, 1072, 1370, 1499], //净利润-完成值
    seriesLineData2:[9,16, 22, 33, 48, 55, 64, 80, 103, 112], //净利润-目标达成率

  },
  // 3规模成长
  liabilities:{
    title: '规模成长',
    itemTitle:['在管面积','人均在管面积'],
    xAxisData:['2015','2016','2017','2018'],
    yAxisData:['0','20000','40000','6000','80000'],
    yAxisData1:['0','0.2','0.4','0.6','0.8'],
    seriesLineData1:[879,1218,1488,1751], //规模成长-在管面积
    seriesLineData3:[0.51, 0.52, 0.56, 0.64], //规模成长-人均在管面积
    

  },
   // 4物业费收缴
  propertyFee:{
    title: '物业费收缴',
    itemTitle:['完成值','目标值','收缴率'],
    xAxisData:['1','2','3','4','5','6','7','8','9','10','11','12'],
    yAxisData:['0','250','500','750','1000'],
    yAxisData1:['0','25','50','75','100'],
    seriesBarData:[9613, 11567, 13055, 15039, 16593, 18159, 19369, 20464, 21959, 23325], //当年物业费-完成值
    seriesLineData1:[94,94,94,94,94,94,94,94,94,94,94], //当年物业费-目标值
    // seriesLineData2:[5,10, 30, 4.5, 6.3, 10, 22, 23, 28, 16, 12.0, 6.2], //当年物业费-收缴率
    seriesLineData3:[34,40, 45, 52, 56, 62, 66, 72, 75, 80], //当年物业费-收缴率

  },
  // 5人员数量
  personNum:{
    title: '人员数量',
    itemTitle:['工程','客服','保洁','保洁','自有','外委'],
    seriesData:{
      one:[
        {value:2343, name:'自有'},
        {value:3182, name:'外委'},
      ],
      two:[
        {value:573, name:'工程'},
        {value:643, name:'客服'},
        {value:1861, name:'保洁'},
        {value:1770, name:'秩序'},
      ]
    }

  },
  // 6客户满意度
  satisfaction:{
    title: '客户满意度',
    indicatorValue:[   // 满意度 最大值
      { text: '客户服务 78', max: 100},
      { text: '安全管理 74', max: 100},
      { text: '车辆管理 64', max: 100},
      { text: '清洁卫生 77', max: 100},
      { text: '绿化养护 82', max: 100},
      { text: '公共设施维护 75', max: 100},
      { text: '入户维修 76', max: 100},
      { text: '装修管理 70', max: 100},
      { text: '社区文化活动 77', max: 100},
      { text: '物业人员 79', max: 100}
      ],
      seriesDataValue: [78,74,64,77,82,75,76,70,77,79], //实际满意度评价
      seriesDataName:'实际满意度',
      seriesDataValue1: [72,72,72,72,72,72,72,72,72,72], //平均满意度
      seriesDataName1:'平均满意度'

  },
  // 7公区能耗
  waterElectric:{
    title: '公区能耗',
    itemTitle:['用水','用电'],
    xAxisData:['1','2','3','4','5','6','7','8','9','10','11','12'],
    yAxisData:['0','2','4','6','8','10'],
    yAxisData1:['0','200','400','600','800'],
    seriesLineData1:[4.05,4.62,3.17,2.73,4.30,4.74,8.86,6.58,7.53,7.28], //用水用电情况-用水
    seriesLineData2:[418,424,405,420,396,464,587,647,623,484], //用水用电情况-用电
  },
// 8地图
  equipmentChart:{
    companyleft:[
      '北京分公司(63万平米)',
      '北京房山分公司(63万平米)',
      '北京门头沟分公司(44万平米)',
      '北京通州分公司(51万平米)',
      '北京顺义分公司(13万平米)',
      '北京大兴分公司(10万平米)',
      '北京朝阳分公司(0万平米)',
      '北京第一分公司(0万平米)',
      '天津分公司(65万平米)',
      '保定分公司(43万平米)',
      '成都分公司(172万平米)',
      '武汉分公司(55万平米)',
      '西安分公司(0万平米)',
      '重庆分公司(0万平米)',
      '昆明分公司(0万平米)',
      '贵阳分公司(160万平米)',
      '贵安新区分公司(21万平米)',
    ],
    companyright:[
      '长春分公司(64万平米)',
      '大连分公司(31万平米)',
      '延吉分公司(19万平米)',
      '济南分公司(0万平米)',
      '合肥分公司(206万平米)',
      '南京分公司(39万平米)',
      '徐州分公司(20万平米)',
      '苏州分公司(0万平米)',
      '上海分公司(30万平米)',
      '杭州分公司(58万平米)',
      '宁波分公司(0万平米)',
      '象山分公司(8万平米)',
      '嘉兴分公司(0万平米)',
      '福州分公司(0万平米)',
      '长沙分公司(80万平米)',
      '广州分公司(50万平米)',
      '佛山分公司(20万平米)',
      '南宁分公司(90万平米)',
    ],
    realCharge:[
      {
      title:'今日实收',
      time:'2018-11-09 00:00:00',
      money:'1605143',
      unit:'元',
    },
    {
      title:'累计实收',
      time:'',
      money:'46545',
      unit:'万元'

    }
  ],
    mapAllStatistics:[
      {
        title:'在管面积',
        data:'1548',
        unit:'万平米'
        },
        {
        title:'在管户数',
        data:'12',
        unit:'万'
        },
        {
        title:'在管项目',
        data:'78',
        unit:'个'
        },
        {
        title:'储备项目',
        data:'54',
        unit:'个'
        },
    ],
    companyName:[
      {
        name:'贵阳水岸天街Ⅰ期'

      },
      {
        name:'贵阳山语苑  '
      },
      {
        name:'贵阳水岸天街Ⅱ期'
      },
      {
        name:'贵阳山锦苑'
      },
      {
        name:'贵阳五彩生活广场'
      },
      {
        name:'贵阳天筑苑'
      },
      {
        name:'贵阳水岸广场'
      },
      {
        name:'贵阳望水苑'
      },
      {
        name:'贵阳山秀苑'
      },
      {
        name:'贵阳观水苑'
      },
      {
        name:'贵阳山水苑'
      },
      {
        name:'贵阳悦水苑'
      },
      {
        name:'贵阳山青苑'
      },
      {
        name:'贵阳悦水贵阳二戈寨地块（储备'
      },
      
  ]
  },
  // 9物业费单价
  propertyFeeid:{
    title:'物业费单价',
    xAxisName:'在管面积',
    yAxisName:'物业费平均单价',
    zaiguanmianji:[
      {
          name:'京津冀',
          type:'scatter',
          data: [[2.66,424]
          ],
          symbolSize:7
      },
    {
          name:'华东',
          type:'scatter',
          data: [[1.84,362]
          ],
          symbolSize:8
      },
    {
          name:'华南',
          type:'scatter',
          data: [[2.10,241]],
          symbolSize:6
      },
    {
          name:'西南',
          type:'scatter',
          data: [[1.84,362]
          ],
          symbolSize:15
      },
    {
          name:'东北',
          type:'scatter',
          data: [[2.02,113]
          ],
      },
    {
          name:'全国',
          type:'scatter',
          data: [[2.4,1548]],
          symbolSize:20
      }
    
    
  ]
  },
  // 10物业费预收  同9
  prepaidPropertyCharges:{
    title:'物业费预收',
    xAxisName:'预收金额',
    yAxisName:'预收率',
    zaiguanmianji:[
      {
          name:'京津冀',
          type:'scatter',
          data: [[18,1729]
          ],
          symbolSize:18
      },
    {
          name:'华东',
          type:'scatter',
          data: [[7,412]
          ],
          symbolSize:8
      },
    {
          name:'华南',
          type:'scatter',
          data: [[5,211]],
          symbolSize:6
      },
    {
          name:'西南',
          type:'scatter',
          data: [[8,564]
          ],
          symbolSize:15
      },
    {
          name:'东北',
          type:'scatter',
          data: [[6,114]
          ],
      },
    {
          name:'全国',
          type:'scatter',
          data: [[10,3031]],
          symbolSize:20
      }
    
    
  ]
  },
  // 多种经营
  operationsMultiple:{
    title: '多种经营',
    itemTitle:['完成值','目标值','月度完成率','年度度完成率'],
    xAxisData:['1','2','3','4','5','6','7','8','9','10','11','12'],
    yAxisData:['0','250','500','750','1000'],
    // yAxisData1:['0','25','50','75','100'],
    seriesLineData:[6649,6649,6649,6649,6649,6649,6649,6649,6649,6649,6649], //多种经营-目标值
    seriesBarData1:[561,979,1460,2281,3009,3688,4339,5023,5511,6094], //多种经营-完成值
    seriesLineData2:[101,88,88,103,109,111,112,113,111,110], //多种经营-月度完成率
    seriesLineData3:[8,15,22,34,45,55,65,76,83,92], //多种经营-年度度完成率
  }
  // end --lyf
  
};

export default Constants;